fabrika/src/InformationRegisters/НастройкаПолейОтправки/НастройкаПолейОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаПолейОтправки</name>
  <attributes>
    <name>Видимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипДвиженияДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.ПолучателиДДС</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fabrika/src/InformationRegisters/ДДС/ДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДДС</name>
  <comment>Хранит данные по ДДС холдинга</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СконвертированнаяСумма</name>
    <comment>Сумма после конвертации</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеньВДень</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НомерВБухгалтерии</name>
    <type>
      <types>DocumentRef.ТаможняРассчёты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <comment>Плановая дата прихода</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>105</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипОрганизации</name>
    <type>
      <types>EnumRef.ТипОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДвижения</name>
    <type>
      <types>EnumRef.ТипДвиженияДДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.ПолучателиДДС</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорыКонтрагентов</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПлатежа</name>
    <type>
      <types>DocumentRef.ТаможняРассчёты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fabrika/src/Enums/ТипДвиженияДДС/ТипДвиженияДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДвиженияДДС</name>
  <enumValues>
    <name>ОстатокНаНачало</name>
  </enumValues>
  <enumValues>
    <name>Поступление</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>ОстатокНаКонец</name>
  </enumValues>
</mdclass:Enum>

fabrika/src/InformationRegisters/НастройкаПолейОтправки/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Расшифровка) Тогда
		
		Организации = Новый СписокЗначений;
		ПолучитьСписокОрганизаций(Параметры.Расшифровка.РасшифровкаМассив, Организации, Параметры.Расшифровка.ДанныеРасшифровки, Параметры.ДобавитьОрганизации);
		
		Отбор = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ПолеОтбора = ?(НЕ Параметры.ДобавитьОрганизации, "Организация", "Организация.ИНН");
		
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеОтбора);
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		Отбор.ПравоеЗначение = Организации;	  
		
		Параметры.Отбор.Вставить("ТипДвижения", Перечисления.ТипДвиженияДДС.Списание);
		
		Если Параметры.ДобавитьОрганизации Тогда
			ГруппировкаСписка = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ГруппировкаСписка.Поле = Новый ПолеКомпоновкиДанных("Организация");
			Элементы.Список.НачальноеОтображениеДерева = НачальноеОтображениеДерева.НеРаскрывать;
		КонецЕсли;
		
	КонецЕсли;	
	
	
КонецПроцедуры
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////



#Область ОбработкаСписка
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Расшифровка) Тогда
		
		Если НЕ Параметры.ДобавитьОрганизации Тогда
			ОповеститьОВыборе(Элемент.ТекущиеДанные.Получатель);	
		Иначе
			СтандартнаяОбработка = ЛОЖЬ;
			ОповеститьОВыборе(ВыбраннаяСтрока.Ключ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отбор = Новый Структура("Организация, ТипДвижения, Получатель",
	                         Элемент.ТекущиеДанные.Организация,
							 Элемент.ТекущиеДанные.ТипДвижения,
							 Элемент.ТекущиеДанные.Получатель);
	
	СписокПередУдалениемНаСервере(Отказ, Отбор);
	
	Если Отказ Тогда
		ОткрытьФорму("РегистрСведений.ДДС.ФормаСписка", Новый Структура("Отбор, КлючПользовательскихНастроек", Отбор, "Пустые"));
		ВызватьИсключение("Есть движения ДДС!!!");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПередУдалениемНаСервере(Отказ, Отбор)
	
	ДДС = РегистрыСведений.ДДС.СоздатьНаборЗаписей();
	
	Для Каждого ЭлементОтбора Из Отбор Цикл
		ДДС.Отбор[ЭлементОтбора.Ключ].Установить(ЭлементОтбора.Значение);
	КонецЦикла;
	
	ДДС.Прочитать();
	
	Если ДДС.Количество() > 0 Тогда
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти



&НаСервереБезКонтекста
Процедура ПолучитьСписокОрганизаций(МассивРасшифровок, Организации, ДанныеРасшифровки, ДобавитьОрганизации = ЛОЖЬ)
	
	Для Каждого Расшифровка из МассивРасшифровок Цикл
		
		СтруктураРасшифровки = ОбщийМодульСервер.ПолучениеРасшифровкиВСтруктуру(Расшифровка, ДанныеРасшифровки, Новый Структура);
		
		Попытка
			Если НЕ ДобавитьОрганизации Тогда
				Организации.Добавить(СтруктураРасшифровки.Организация);
			Иначе
				Организации.Добавить(СтруктураРасшифровки.Получатель.ИНН);   				
			КонецЕсли; 
		Исключение
		КонецПопытки;
		                     		
	КонецЦикла;  
		
КонецПроцедуры
